### Import data

In [49]:
import pandas as pd

file= pd.read_csv("C:/Users/Administrateur/Desktop/mes_idfno2.csv",encoding= 'unicode_escape',delimiter=";",parse_dates=True)

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (9) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [50]:
file.head()

,id,nom_dept,nom_com,id_com,nom_statio,code_stati,typologie,nom_poll,id_poll_ue,valeur,unite,metrique,date_debut,date_fin,statut_val,x,y
0,1,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,73,ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
1,2,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,57,ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
2,3,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,65,ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
3,4,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,81,ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
4,5,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,74,ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011

In [118]:
file.isnull().sum()

id            0
nom_dept      0
nom_com       0
id_com        0
nom_statio    0
code_stati    0
typologie     0
nom_poll      0
id_poll_ue    0
valeur        0
unite         0
metrique      0
date_debut    0
date_fin      0
statut_val    0
x             0
y             0
dtype: int64

### select columns

In [53]:
file_no2=file[["nom_dept","nom_com","id_com","valeur","date_debut","date_fin"]]
file_no2.tail()

              nom_dept        nom_com  id_com valeur  date_debut    date_fin
407295  HAUTS-DE-SEINE  GENNEVILLIERS   92036   19,6  19/11/2020  19/11/2020
407296  HAUTS-DE-SEINE  GENNEVILLIERS   92036   24,4  19/11/2020  19/11/2020
407297  HAUTS-DE-SEINE  GENNEVILLIERS   92036   21,1  19/11/2020  19/11/2020
407298  HAUTS-DE-SEINE  GENNEVILLIERS   92036   14,4  19/11/2020  19/11/2020
407299  HAUTS-DE-SEINE  GENNEVILLIERS   92036   10,3  19/11/2020  19/11/2020

In [54]:
file_no2.count()

nom_dept      407300
nom_com       407300
id_com        407300
valeur        407300
date_debut    407300
date_fin      407300
dtype: int64

### Show district

In [55]:
file_no2["id_com"].value_counts()

78646    26727
94081    26465
77258    26458
95088    26404
95277    26404
93073    26384
95633    26332
95612    26308
92036    26239
75106    26116
75112    25930
91228    25784
93066    25559
75115    24715
75102    24705
75104    16770
Name: id_com, dtype: int64

In [56]:
file_no2["nom_dept"].value_counts()

PARIS                118236
VAL-D'OISE           105448
SEINE-SAINT-DENIS     51943
YVELINES              26727
VAL-DE-MARNE          26465
SEINE-ET-MARNE        26458
HAUTS-DE-SEINE        26239
ESSONNE               25784
Name: nom_dept, dtype: int64

In [57]:
file["date_fin"].value_counts()

09/02/2019    400
12/01/2019    400
28/03/2019    400
16/12/2018    400
22/02/2019    400
             ...
15/06/2020    142
17/09/2020    136
19/08/2020    108
18/09/2017    108
30/05/2019     76
Name: date_fin, Length: 1156, dtype: int64

### Select Paris districs

In [58]:
df=file_no2[file_no2["nom_dept"]=="PARIS"]

In [59]:
df["nom_dept"].value_counts()

PARIS    118236
Name: nom_dept, dtype: int64

In [60]:
df["id_com"].value_counts()

75106    26116
75112    25930
75115    24715
75102    24705
75104    16770
Name: id_com, dtype: int64

In [61]:
df.tail()

,nom_dept,nom_com,id_com,valeur,date_debut,date_fin
407245,PARIS,PARIS-15E-ARRONDISSEMENT,75115,"4,7",19/11/2020,19/11/2020
407246,PARIS,PARIS-15E-ARRONDISSEMENT,75115,"3,3",19/11/2020,19/11/2020
407247,PARIS,PARIS-15E-ARRONDISSEMENT,75115,"3,9",19/11/2020,19/11/2020
407248,PARIS,PARIS-15E-ARRONDISSEMENT,75115,"9,1",19/11/2020,19/11/2020
407249,PARIS,PARIS-15E-ARRONDISSEMENT,75115,"15,9",19/11/2020,19/11/2020

### Rename columns

In [62]:
#
df=df[["id_com","valeur","date_fin"]]
# df.columns=(["zip_code","no2","date"])
df.tail()

        id_com valeur    date_fin
407245   75115    4,7  19/11/2020
407246   75115    3,3  19/11/2020
407247   75115    3,9  19/11/2020
407248   75115    9,1  19/11/2020
407249   75115   15,9  19/11/2020

In [63]:
df.columns=(["zip_code","no2","date"])

In [64]:
df.head()

   zip_code no2        date
0     75106  73  18/09/2017
1     75106  57  18/09/2017
2     75106  65  18/09/2017
3     75106  81  18/09/2017
4     75106  74  18/09/2017

### Format Zip code

In [65]:
df["zip_code"]=df["zip_code"].apply(lambda x:str(x))
df["zip_code"]=df["zip_code"].apply(lambda x:"750"+ x[3:5])

In [66]:
df["no2"].value_counts()

19       677
21       653
23       652
20       651
15       632
        ...
147,1      1
122,8      1
143,8      1
145,3      1
150        1
Name: no2, Length: 1722, dtype: int64

### format number of traffic (value)

In [67]:
df["no2"]=df["no2"].apply(lambda x:str(x))

In [68]:
import ast
df["no2"]=df["no2"].apply(lambda x:x.split(",")[0] if ',' in x else int(x))

In [69]:
df["no2"]=df["no2"].apply(lambda x:int(x))

In [70]:
df.head()

  zip_code  no2        date
0    75006   73  18/09/2017
1    75006   57  18/09/2017
2    75006   65  18/09/2017
3    75006   81  18/09/2017
4    75006   74  18/09/2017

### format date

In [87]:
pd.to_datetime(df['date'])

176151   2019-01-10
176152   2019-01-10
176153   2019-01-10
176154   2019-01-10
176155   2019-01-10
            ...
407245   2020-11-19
407246   2020-11-19
407247   2020-11-19
407248   2020-11-19
407249   2020-11-19
Name: date, Length: 63623, dtype: datetime64[ns]

In [88]:
#df['date']=pd.to_datetime(df['date'].astype(str), format='%d/%m/%Y')

### Select date between 01/10/2019 to 19/11/2020

In [89]:
df.shape

(63623, 8)

In [90]:
df["date"].max()

Timestamp('2020-11-19 00:00:00')

In [91]:
df["date"].min()

Timestamp('2019-01-10 00:00:00')

In [92]:
df=df[df["date"]>="01/10/2019"]

In [93]:
df.shape

(63623, 8)

In [94]:
df["date"].max()

Timestamp('2020-11-19 00:00:00')

In [95]:
df["date"].min()

Timestamp('2019-01-10 00:00:00')

In [96]:
df.tail()

,zip_code,no2,date,date_str,year,month,day,weekday
407245,75015,4,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407246,75015,3,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407247,75015,3,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407248,75015,9,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407249,75015,15,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday

In [97]:
df=df[["zip_code","no2","date"]]
df.head()

       zip_code  no2       date
176151    75006   31 2019-01-10
176152    75006   28 2019-01-10
176153    75006   27 2019-01-10
176154    75006   27 2019-01-10
176155    75006   36 2019-01-10

### extract year month weekday

In [98]:
df["date_str"]=df["date"].apply(lambda x:str(x))
df["year"]=df["date_str"].apply(lambda x:x.split("-")[0])
df["month"]=df["date_str"].apply(lambda x:x.split("-")[1])

In [99]:
df['day'] = pd.to_datetime(df['date']).apply(lambda x: x.weekday())

In [100]:
#Monday=0,Tuesday=1,Wednesday=2,Thursday=3,Friday=5,Saturday=5,Sunday=6
def func(x):
    if x ==0:
        return "Monday"
    elif x==1:
        return "Tuesday"
    elif x==2:
        return "Wednesday"
    elif x==3:
        return "Thursday"
    elif x==4:
        return "Friday"
    elif x==5:
        return "Saturday"
    elif x==6:
        return "Sunday"
    else:
        return "null"
    # Add elif statements....

df['weekday'] = df['day'].apply(func)

In [ ]:
# another technic to access weekday
df['day_of_week'] = df['my_dates'].dt.day_name()

In [101]:
df.tail()

,zip_code,no2,date,date_str,year,month,day,weekday
407245,75015,4,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407246,75015,3,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407247,75015,3,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407248,75015,9,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407249,75015,15,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday

In [102]:
df['weekday'].value_counts()

Wednesday    9309
Tuesday      9185
Thursday     9094
Saturday     9088
Sunday       9013
Monday       8989
Friday       8945
Name: weekday, dtype: int64

### save to csv

In [103]:
df.to_csv("C:/Users/Administrateur/Documents/bike_project/pollution_no2_final.csv", sep=";", encoding="utf-8")

### import csv file

In [104]:
# save dataset to csv 
df=pd.read_csv("C:/Users/Administrateur/Documents/bike_project/pollution_no2_final.csv", delimiter=";",index_col=0)
df.tail()

,zip_code,no2,date,date_str,year,month,day,weekday
407245,75015,4,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407246,75015,3,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407247,75015,3,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407248,75015,9,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday
407249,75015,15,2020-11-19,2020-11-19 00:00:00,2020,11,3,Thursday

In [116]:
df.isna().sum()

zip_code    0
no2         0
date        0
date_str    0
year        0
month       0
day         0
weekday     0
dtype: int64

In [105]:
# Synthese de pre process du dataset : nous avons 8 arrondissement date entre 2019-01-10 et le 2020-11-18

### GroupBY

In [108]:
df.groupby(['zip_code',"year"]).no2.agg([len, min, max])

                len  min  max
zip_code year
75002    2019  7130    5  224
         2020  6943    2  228
75004    2019  5502    4  127
75006    2019  7836    5  146
         2020  7090    1  115
75012    2019  7880    4  383
         2020  7122    3  172
75015    2019  7021    1  122
         2020  7099    0  125

In [110]:
df.groupby(['zip_code',"weekday"]).no2.agg([len, min, max])

                     len  min  max
zip_code weekday
75002    Friday     1990    3  149
         Monday     2023    2  189
         Saturday   1996    3  158
         Sunday     1992    3  144
         Thursday   2008    3  139
         Tuesday    2016    4  228
         Wednesday  2048    4  224
75004    Friday      763    8  126
         Monday      779    4  119
         Saturday    797    5  127
         Sunday      789    6  124
         Thursday    785    6  124
         Tuesday     802    6   97
         Wednesday   787    6  121
75006    Friday     2088    3  137
         Monday     2102    1  125
         Saturday   2110    3  146
         Sunday     2096    1  136
         Thursday   2172    3  137
         Tuesday    2159    1  132
         Wednesday  2199    3  142
75012    Friday     2128    4  175
         Monday     2115    3  179
         Saturday   2150    5  161
         Sunday     2101    3  179
         Thursday   2131    4  383
         Tuesday    2191    3  175
         Wednesday  2186    6  179
75015    Friday     1976    1  122
         Monday     1970    0  125
         Saturday   2035    0  107
         Sunday     2035    0   96
         Thursday   1998    0  104
         Tuesday    2017    0  113
         Wednesday  2089    0  111

In [111]:
#moyenne de pollution par annnée dans chaque arrondissement

In [112]:
df.groupby(['zip_code', 'year']).no2.mean().round()

zip_code  year
75002     2019    60.0
          2020    37.0
75004     2019    32.0
75006     2019    46.0
          2020    26.0
75012     2019    61.0
          2020    49.0
75015     2019    25.0
          2020    17.0
Name: no2, dtype: float64

In [47]:
#les jours par arrondissement les plus pollués

In [48]:
df.sort_values(by='no2',ascending=False)

,zip_code,no2,date,date_str,year,month,day,weekday
237043,75012,383,2019-07-11,2019-07-11 00:00:00,2019,7,1,Tuesday
385397,75002,228,2020-09-15,2020-09-15 00:00:00,2020,9,2,Wednesday
241474,75002,224,2019-07-24,2019-07-24 00:00:00,2019,7,1,Tuesday
241475,75002,223,2019-07-24,2019-07-24 00:00:00,2019,7,1,Tuesday
241904,75012,213,2019-07-25,2019-07-25 00:00:00,2019,7,1,Tuesday
...,...,...,...,...,...,...,...,...
358363,75015,0,2020-06-28,2020-06-28 00:00:00,2020,6,2,Wednesday
401191,75015,0,2020-11-01,2020-11-01 00:00:00,2020,11,2,Wednesday
368896,75015,0,2020-07-28,2020-07-28 00:00:00,2020,7,2,Wednesday
391960,75015,0,2020-10-05,2020-10-05 00:00:00,2020,10,2,Wednesday
360763,75015,0,2020-07-05,2020-07-05 00:00:00,2020,7,2,Wednesday